# HostByLinkNavigator Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes..::..HostByLinkNavigator Property
DockablePanes..::..BuiltInDockablePanes Class See Also
---
The host by link navigator pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static DockablePaneId HostByLinkNavigator { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostByLinkNavigator As DockablePaneId
	Get
```

Visual C++
---
```text
public:
static property DockablePaneId^ HostByLinkNavigator {
	DockablePaneId^ get ();
}
```

# See Also
DockablePanes..::..BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace